EgresUV/app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
	def show
		@user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
	def edit

    	@user = User.find(params[:id])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `telefono`, `direccion`, `genero`, `fechaNac`, `matricula`, `promedio`, `carrera`, `fechaEgreso`, `empleo`, `lugarEmpleo`, `areaTrabajo`, `idioma`, `rol`) VALUES ('Carlos Antonio Bulnes Dominguez', 'carlos0bulnes2@gmail.com', '2017-10-12 17:53:28', '2017-10-12 17:53:28', '$2a$10$zIuvNXgfhE4PmDmjDJQS8.Iu4PhoL72am7WQUyKvGJefI4URsz5BW', '2281606000', 'Plaza Cristal # 321', 'Hombre', '1987-08-14', 's11087654', '8.4', 'Informatica', '2015-02-01', 'No', 'Ninguno', 'Programador', 'Ingles', 'false')
---
	def create
		@user = User.new(user_params)
	    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
UPDATE `users` SET `email` = 'tablada_fei2@gmail.com', `password_digest` = '$2a$10$pEapm.k2o9N.NR1ZwsQNRuaLv.EJGIICv4CnZKu80AGB4xY8SdYHu', `puesto` = 'Secretaria', `correoInstitucional` = 'tablada_fei@uv.com', `fechaNac` = '1995-04-15', `updated_at` = '2017-10-12 20:58:46' WHERE `users`.`id` = 9
---
	def update
	    @user = User.find(params[:id])

	    if @user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2
---
	def destroy
	    @user = User.find(params[:id])
	    @user.destroy