PokeDex/app/controllers/pokemons_controller.rb

SELECT `pokemons`.* FROM `pokemons`
---
  def index

    @pokemons = Pokemon.all

INSERT INTO `pokemons` (`nombre`, `apodo`, `peso`, `altura`, `vida`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES ('Pikachu', 'Pika', 3.0, 80.0, 30, 'pikachu.jpg', 'image/jpeg', 116905, '2017-03-12 21:12:10', '2017-03-12 21:12:10', '2017-03-12 21:12:10')
INSERT INTO `perteneces` (`type_id`, `pokemon_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-03-12 21:12:10', '2017-03-12 21:12:10')
---
  def create
    @pokemon = Pokemon.new(pokemon_params)

    respond_to do |format|
      if @pokemon.save
        format.html { redirect_to @pokemon, notice: 'Pokemon was successfully created.' }
        format.json { render :show, status: :created, location: @pokemon }
      else
        format.html { render :new }
        format.json { render json: @pokemon.errors, status: :unprocessable_entity }
      end
    end

    @pertenece = Pertenece.new(pokemon_id: @pokemon.id, type_id: :types_ids)
    @pertenece.save

UPDATE `pokemons` SET `image_updated_at` = '2017-03-13 16:13:50', `image_file_name` = 'pikachu.jpg', `updated_at` = '2017-03-13 16:13:50' WHERE `pokemons`.`id` = 1
---
  def update
    respond_to do |format|
      if @pokemon.update(pokemon_params)

DELETE FROM `pokemons` WHERE `pokemons`.`id` = 1
---
  def destroy
    @pokemon.destroy

SELECT  `pokemons`.* FROM `pokemons` WHERE `pokemons`.`id` = 1 LIMIT 1
---
    def set_pokemon
      @pokemon = Pokemon.find(params[:id])