PokeDex/app/controllers/types_controller.rb

SELECT `types`.* FROM `types`
---
  def index
    @types = Type.all

INSERT INTO `types` (`nombre`, `created_at`, `updated_at`) VALUES ('Fuego', '2017-03-12 20:41:13', '2017-03-12 20:41:13')
---
  def create
    @type = Type.new(type_params)

    respond_to do |format|
      if @type.save

DELETE FROM `types` WHERE `types`.`id` = 2
---
  def destroy
    @type.destroy

SELECT  `types`.* FROM `types` WHERE `types`.`id` = 2 LIMIT 1
---
    def set_type
      @type = Type.find(params[:id])