PokeDex/app/views/pokemons/_form.html.erb

SELECT `types`.* FROM `types`
---
    <br><%= f.label :tipos %><br>
    <%= f.collection_check_boxes(:type_ids, Type.all, :id, :clase) %>